Repository: changch223/INTUITION-Gut-Challenge
Catalog: BoomOrBonus/*.lproj/Localizable.strings
Languages: ja, ru, zh_hans, zh_hant

# GameTitle
source: How strong is your intuition?
ja: あなたの直感力はどれくらい？
ru: Насколько сильна ваша интуиция?
zh_hans: 你的直觉力有多强？
zh_hant: 你的直覺力有多強？

# GameDescription
source: The ultimate 2-choice challenge! Pick the safe option using your intuition. How far can you go? Are you an intuition master or just a lucky guesser?
ja: 2択の極限チャレンジ！直感で安全な選択肢を選ぼう。何ステージ突破できる？直感マスター、それとも勘まかせ？
ru: Испытание на два выбора! Выбирайте безопасный вариант, полагаясь на интуицию. Как далеко вы сможете зайти? Вы мастер интуиции или просто везунчик?
zh_hans: 二选一极限挑战！凭直觉选出安全选项，能闯过几关就看你的感觉！你，是直觉达人，还是乱猜高手？
zh_hant: 二選一極限挑戰！憑直覺選出安全選項，能闖過幾關就看你的感覺！你，是直覺達人，還是亂猜高手？

source: Remaining attempts:
ja: 残りの挑戦回数：
ru: Оставшиеся попытки:
zh_hans: 剩余挑战次数：
zh_hant: 剩餘挑戰次數：

# CurrentValue
source: Your current score:
ja: 現在のスコア：
ru: Ваш текущий счет:
zh_hans: 你目前的总分：
zh_hant: 你目前的總分：

# LevelsPassedPrefix
source: You've survived
ja: あなたはすでに
ru: Вы прошли
zh_hans: 你已惊险闯过
zh_hant: 你已驚險闖過

# LevelsPassedSuffix
source: rounds. Will you trust your gut and keep going?
ja: ステージ突破！このまま直感を信じて進む？
ru: раундов. Доверитесь своей интуиции и продолжите?
zh_hans: 关，继续赌直觉还是见好就收？
zh_hant: 關，繼續賭運氣還是見好就收？

# GameOver
source: Oops—your intuition missed this time!
ja: あらら～今回は外れちゃった！
ru: Упс — в этот раз интуиция подвела!
zh_hans: 哎呀～这次失误了！
zh_hant: 啊嘞～怎麼就爆炸了呢？

# FinalValue
source: Your final score:
ja: 最終スコア：
ru: Ваш финальный счет:
zh_hans: 你最后的总分是：
zh_hant: 你最後的總分是：

# LevelsPassed
source: Total levels cleared:
ja: 突破したステージ数：
ru: Всего пройдено уровней:
zh_hans: 总共闯关：
zh_hant: 總共闖關：

# IntuitionScore
source: Intuition Rank:
ja: 直感ランク：
ru: Ранг интуиции:
zh_hans: 直觉力等级：
zh_hant: 直覺力等級：

# Restart
source: One try isn’t enough—trust your intuition again!
ja: 一度じゃ足りない！もう一度直感を信じて挑戦！
ru: Одной попытки недостаточно — доверьтесь своей интуиции снова!
zh_hans: 直觉不能只靠一次，再试一次！
zh_hant: 直覺不能只靠一次，再試一次！

# Encouragement1
source: Amazing choice! 🍀
ja: その選択、最高！🍀
ru: Отличный выбор! 🍀
zh_hans: 你刚刚的选择太神啦 🍀
zh_hant: 你剛剛的選擇太神啦 🍀

# Encouragement2
source: That was close! Lucky guess?
ja: ギリギリセーフ！すごい！
ru: На волоске! Просто удача?
zh_hans: 差点就GG了！你太欧了吧？
zh_hant: 差點就GG了！你也太歐了吧？

# Encouragement3
source: That’s lotto-level intuition 🎯
ja: その直感、宝くじレベル 🎯
ru: Интуиция на уровне лотереи 🎯
zh_hans: 这直觉能去买彩票了 🎯
zh_hant: 這運氣能買樂透了 🎯

# Encouragement4
source: That was insane accuracy!
ja: すごい精度！
ru: Поразительная точность!
zh_hans: 神准预判，太强了！
zh_hant: 逆天改命，這是天選之人！

# Encouragement5
source: Your intuition is on fire today!
ja: 今日の直感、キレキレ！
ru: Ваша интуиция сегодня просто пылает!
zh_hans: 今天的直觉感应超灵！
zh_hant: 今天的直覺感度100%！

# Encouragement6
source: You're on a hot streak!
ja: 連勝中！絶好調！
ru: Вы на полосе везения!
zh_hans: 你正处于连胜状态！
zh_hant: 你正處於連勝的狀態！

# Encouragement7
source: Success is smiling upon you!
ja: 運が味方してる！
ru: Удача на вашей стороне!
zh_hans: 成功正在向你招手！
zh_hant: 成功之神正對你微笑！

# Encouragement8
source: Fearless moves bring great rewards!
ja: 恐れずに選んだ、その直感が正解！
ru: Смелые решения приносят большие награды!
zh_hans: 勇者无惧，直觉常在！
zh_hant: 勇者無懼，幸運常伴！

# Encouragement9
source: Your intuition is shining!
ja: あなたの直感が輝いてる！
ru: Ваша интуиция сияет!
zh_hans: 你的直觉闪耀全场！
zh_hant: 你的直覺閃耀全場

# Encouragement10
source: Nice! Your intuition is your superpower!
ja: さすが！直感はあなたのスーパーパワー！
ru: Отлично! Интуиция — ваша суперсила!
zh_hans: 厉害！直觉力就是你的超能力！
zh_hant: 幹得好，直覺力才是你的超能力！

# Encouragement11
source: Every step takes you closer to victory!
ja: 勝利に一歩近づいた！
ru: Каждый шаг приближает к победе!
zh_hans: 每一步都离胜利更近！
zh_hant: 每一步都讓你更接近勝利！

# Encouragement12
source: You're unstoppable!
ja: 止められない勢い！
ru: Вас не остановить!
zh_hans: 你势不可挡！
zh_hant: 層層突破，成功無法阻擋！

# Encouragement13
source: Your gut feeling was right!
ja: やっぱり感覚は正しかった！
ru: Ваше предчувствие оказалось верным!
zh_hans: 你的感觉果然靠谱！
zh_hant: 你的感覺果然有根據！

# Encouragement14
source: You’ve turned the tide—victory ahead!
ja: 流れを変えた！勝利目前！
ru: Вы переломили ход игры — победа близка!
zh_hans: 你已经扭转战局，胜利在望！
zh_hant: 你已經扭轉局勢，勝利在望！

source: Probability Info
ja: 確率情報
ru: Информация о вероятности
zh_hans: 概率信息
zh_hant: 機率資訊

source: Game Records
ja: プレイ記録
ru: Рекорды
zh_hans: 游戏记录
zh_hant: 遊玩記錄

# RatingStandards
source: Ranking
ja: 評価基準
ru: Рейтинг
zh_hans: 评分标准
zh_hant: 評分標準

# ExtraAttempts
source: Get 30 Extra Attempts
ja: 追加で30回のチャンスを獲得
ru: Посмотрите рекламу и получите 30 дополнительных попыток!
zh_hans: 观看广告，立即获得额外30次挑战机会！
zh_hant: 觀看廣告，立即獲得額外30次挑戰機會！

# AttemptsLimitReached
source: You've used all your attempts today!
ja: 本日のプレイ回数は上限に達しました！
ru: Вы использовали все попытки на сегодня!
zh_hans: 今天的游戏次数已达上限！
zh_hant: 今天遊玩次數已達上限！

source: OK
ru: ОК
zh_hans: 好
zh_hant: 好

source: Close
ja: 閉じる
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# OperatorProbabilitySection
source: Operator Probabilities
ja: 演算子の確率
ru: Вероятности операторов
zh_hans: 运算符概率
zh_hant: 演算子機率

source: Addition (+)
ja: 加算 (+)
ru: Сложение (+)
zh_hans: 加法 (+)
zh_hant: 加法 (+)

source: Subtraction (-)
ja: 減算 (-)
ru: Вычитание (-)
zh_hans: 减法 (-)
zh_hant: 減法 (-)

source: Multiplication (×)
ja: 乗算 (×)
ru: Умножение (×)
zh_hans: 乘法 (×)
zh_hant: 乘法 (×)

# NumberProbabilitySection
source: Number Probabilities (1 - 50)
ja: 数字の確率 (1 - 50)
ru: Вероятности чисел (1 - 50)
zh_hans: 数字概率 (1 - 50)
zh_hant: 數字機率 (1 - 50)

# NumberPrefix
source: Number
ja: 数字
ru: Число
zh_hans: 数字
zh_hant: 數字

# DailyRecordsTitle
source: Daily High Scores
ja: 本日の最高記録
ru: Ежедневные рекорды
zh_hans: 每日最高记录
zh_hant: 每日最高紀錄

source: Date:
ja: 日付：
ru: Дата:
zh_hans: 日期：
zh_hant: 日期：

# FinalValueRecord
source: Final Score:
ja: 最終値：
ru: Финальный счет:
zh_hans: 最终数值：
zh_hant: 最終數值：

# SafeOptionsLevels
source: Safe Choices:
ja: セーフオプション数：
ru: Безопасные выборы:
zh_hans: 安全选项数：
zh_hant: 安全選項數：

# LevelsPassedRecord
source: Rounds:
ja: 突破ステージ：
ru: Раунды:
zh_hans: 闯关：
zh_hant: 闖關：

source: Intuition Rating:
ja: 直感の評価：
ru: Оценка интуиции:
zh_hans: 直觉评分：
zh_hant: 運氣評分：

# AdNotReadyTitle
source: Ad Not Ready
ja: 広告の準備ができていません
ru: Реклама недоступна
zh_hans: 广告尚未准备好
zh_hant: 廣告尚未準備好

# AdNotReadyMessage
source: Please try again later.
ja: しばらくしてからもう一度お試しください。
ru: Попробуйте позже.
zh_hans: 请稍后再尝试。
zh_hant: 請稍後再嘗試。

# IntuitionLevel_VeryBad
source: No intuition at all
ja: 全然直感なし
ru: Интуиция отсутствует
zh_hans: 毫无直觉
zh_hant: 毫無直覺

# IntuitionLevel_ExtremelyBad
source: Way off
ja: 直感が完全に外れ
ru: Совсем мимо
zh_hans: 直觉跑偏了
zh_hant: 直覺大走鐘

# IntuitionLevel_Terrible
source: Super unlucky
ja: とても運が悪い
ru: Очень не везёт
zh_hans: 超级倒霉
zh_hant: 倒楣透頂

# IntuitionLevel_Bad
source: Completely lost
ja: 完全に迷走中
ru: Полная потеря
zh_hans: 完全迷路
zh_hant: 直覺迷路了

# IntuitionLevel_SlightlyBad
source: Not very accurate
ja: 直感が少し鈍い
ru: Не очень точно
zh_hans: 感觉不太灵
zh_hant: 感覺不太靈

# IntuitionLevel_Average
source: Average
ja: 平均的
ru: Средне
zh_hans: 普通水准
zh_hant: 普通水準

# IntuitionLevel_Fair
source: Slightly intuitive
ja: 少し冴えてる
ru: Слабая интуиция
zh_hans: 略有直觉
zh_hant: 小有靈感

# IntuitionLevel_SmallBlessing
source: Very intuitive
ja: 直感アップ
ru: Очень интуитивно
zh_hans: 算有直觉
zh_hant: 預感強到爆

# IntuitionLevel_MediumBlessing
source: Highly accurate
ja: かなり正確
ru: Высокая точность
zh_hans: 神准预测
zh_hant: 神準直覺

# IntuitionLevel_BigBlessing
source: Master of Intuition
ja: 直感マスター
ru: Мастер интуиции
zh_hans: 直觉大师
zh_hant: 歐皇現世

# IntuitionLevel_VeryGood
source: Prediction Max
ja: 予知能力MAX
ru: Максимум предсказаний
zh_hans: 预知力MAX
zh_hant: 預知感 MAX

# IntuitionLevel_SuperGood
source: Intuition Genius
ja: 直感の天才
ru: Гений интуиции
zh_hans: 直觉天才
zh_hant: 直覺奇才現身

# IntuitionLevel_Legendary
source: Even AI can't keep up
ja: AIも敵わない
ru: Даже ИИ не успевает
zh_hans: AI都比不过你
zh_hant: 預測 AI 都輸你

# IntuitionLevel_God
source: God of Intuition
ja: 直感の神 降臨!
ru: Бог интуиции
zh_hans: 直觉之神降临
zh_hant: 直覺之神降臨

# IntuitionLevel_GodProMax
source: God of Intuition Pro Max
ja: 直感の神ProMax
ru: Бог интуиции Pro Max
zh_hans: 直觉之神 Pro Max
zh_hant: 直覺之神降臨ProMax

# Range_VeryBad
source: final score < -49
ru: финальный счет < -49

# Range_GodProMax
source: final score ≥ 10000
ru: финальный счет ≥ 10000
